/*      Задача №1
        Дан массив:
        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
        необходимо вывести сумму всех значений массива.

        Задача №2
        Дан массив:
        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
        необходимо вывести максимальное значение массива.

        Задача №3
        Дан массив:
        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
        необходимо вывести минимальное значение массива.

        Задача №4
        Дан массив:
        int[] array = {1, 2, 3, 4, 5, 6, 7, 8, 9};
        необходимо вывести среднее арифметическое всех значений массива.

        Задача №5
        Дан массив:
        int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
        необходимо вывести сумму элементов массива.

        Задача №6
        Дан массив:
        int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
        необходимо вывести максимальное значение массива.
*/

public class HW_5_1 {
    public static void main(String[] args) {

        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
        int[][] array1 = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
        int sum = 0;
        int sum1 = 0;
        int max = array[0];
        int max1 = array1[0][0];
        int min = array[0];

        for (int i = 0; i < array.length; i++) {
            sum += array[i];
            if (array[i] > max) {
                max = array[i];
            }
            if (array[i] < min) {
                min = array[i];
            }
        }

        for (int i = 0; i < array1.length; i++) {
            for (int j = 0; j < array1[i].length; j++) {
                sum1 += array1[i][j];
                if (max1 < array1[i][j]) {
                    max1 = array1[i][j];
                }
            }
        }

        System.out.println("Задача №1:\nсумма всех значений массива равна " + sum);
        System.out.println("\nЗадача №2:\nмаксимальное значение массива равно " + max);
        System.out.println("\nЗадача №3:\nминимальное значение массива равно " + min);
        System.out.println("\nЗадача №4:\nсреднее арифметическое всех значений массива равно " + sum / (double) array.length);
        System.out.println("\nЗадача №5:\nсумма элементов массива равна " + sum1);
        System.out.println("\nЗадача №6:\nмаксимальное значение массива равно " + max1);
    }
}


